zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE246/drivers/fsl_clock.h
    kCLOCK_ScgFircAsyncDiv1Clk, /*!< FIRCDIV1_CLK.                                     */
    kCLOCK_ScgFircAsyncDiv2Clk, /*!< FIRCDIV2_CLK.                                     */

    kCLOCK_ScgSysPllAsyncDiv1Clk, /*!< SPLLDIV1_CLK.                                   */
    kCLOCK_ScgSysPllAsyncDiv2Clk, /*!< SPLLDIV2_CLK.                                   */

    /* --------------------------------- Other clock ----------------------------------*/
    kCLOCK_Lpo1kClk,   /*!< 1kHz LPO clock                                             */
    kCLOCK_Lpo32kClk,  /*!< 32kHz LPO clock                                            */
    kCLOCK_Lpo128kClk, /*!< 128kHz LPO clock                                           */
    kCLOCK_LpoClk,     /*!< LPO clock selected by SIM_LPOCLKS[LPOCLKSEL]               */
    kCLOCK_ErClk,      /*!< ERCLK. The external reference clock from SCG.              */
} clock_name_t;

#define kCLOCK_Osc0ErClk       kCLOCK_ErClk
#define CLOCK_GetOsc0ErClkFreq CLOCK_GetErClkFreq /*!< For compatible with other MCG platforms. */

/*!
 * @brief Clock source for peripherals that support various clock selections.
 */
typedef enum _clock_ip_src
{
    kCLOCK_IpSrcNoneOrExt   = 0U, /*!< Clock is off or external clock is used. */
    kCLOCK_IpSrcSysOscAsync = 1U, /*!< System Oscillator async clock.          */
    kCLOCK_IpSrcSircAsync   = 2U, /*!< Slow IRC async clock.                   */
    kCLOCK_IpSrcFircAsync   = 3U, /*!< Fast IRC async clock.                   */
    kCLOCK_IpSrcSysPllAsync = 6U, /*!< SPLL async clock.                       */
    kCLOCK_IpSrcLpoAsync    = 7U  /*!< LPO128 async clock.                     */
} clock_ip_src_t;

#define CLOCK_SIM_CGC_MASK 0x1FU

/*!
 * @brief Peripheral clock name difinition used for clock gate, clock source
 * and clock divider setting.
 * It is defined as SIM_PLATCGC register adress with added 1 in bitfield
 * corresponding to controlled peripheral for peripherals controled by SIM.
 * It is defined as the corresponding register address for peripherals
 * controlled by PCC.
 */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = 0U,

    /* Controlled by SIM */
    kCLOCK_Eim         = (0x40048040U | SIM_PLATCGC_CGCEIM(1)),
    kCLOCK_Erm         = (0x40048040U | SIM_PLATCGC_CGCERM(1)),
    kCLOCK_Dma         = (0x40048040U | SIM_PLATCGC_CGCDMA(1)),
    kCLOCK_Mpu         = (0x40048040U | SIM_PLATCGC_CGCMPU(1)),
    kCLOCK_Mscm        = (0x40048040U | SIM_PLATCGC_CGCMSCM(1)),

    /* Controlled by PCC */
    kCLOCK_Flash0      = 0x40065080U,
    kCLOCK_Dmamux0     = 0x40065084U,
    kCLOCK_Can0        = 0x40065090U,
    kCLOCK_Can1        = 0x40065094U,
    kCLOCK_Ftm3        = 0x40065098U,
    kCLOCK_Adc1        = 0x4006509CU,
    kCLOCK_Can2        = 0x400650ACU,
    kCLOCK_Lpspi0      = 0x400650B0U,
    kCLOCK_Lpspi1      = 0x400650B4U,
    kCLOCK_Lpspi2      = 0x400650B8U,
    kCLOCK_Pdb1        = 0x400650C4U,
    kCLOCK_Crc0        = 0x400650C8U,
    kCLOCK_Pdb0        = 0x400650D8U,
    kCLOCK_Lpit0       = 0x400650DCU,
    kCLOCK_Ftm0        = 0x400650E0U,
    kCLOCK_Ftm1        = 0x400650E4U,
    kCLOCK_Ftm2        = 0x400650E8U,
    kCLOCK_Adc0        = 0x400650ECU,
    kCLOCK_Rtc0        = 0x400650F4U,
    kCLOCK_Lptmr0      = 0x40065100U,
    kCLOCK_PortA       = 0x40065124U,
    kCLOCK_PortB       = 0x40065128U,
    kCLOCK_PortC       = 0x4006512CU,
    kCLOCK_PortD       = 0x40065130U,
    kCLOCK_PortE       = 0x40065134U,
    kCLOCK_Flexio0     = 0x40065168U,
    kCLOCK_Ewm0        = 0x40065184U,
    kCLOCK_Lpi2c0      = 0x40065198U,
    kCLOCK_Lpuart0     = 0x400651A8U,
    kCLOCK_Lpuart1     = 0x400651ACU,
    kCLOCK_Lpuart2     = 0x400651B0U,
    kCLOCK_Ftm4        = 0x400651B8U,
    kCLOCK_Ftm5        = 0x400651BCU,
    kCLOCK_Cmp0        = 0x400651CCU,
} clock_ip_name_t;

/*!
 * @brief SCG status return codes.
 */
enum
{
    kStatus_SCG_Busy       = MAKE_STATUS(kStatusGroup_SCG, 1), /*!< Clock is busy.  */
    kStatus_SCG_InvalidSrc = MAKE_STATUS(kStatusGroup_SCG, 2)  /*!< Invalid source. */
};

/*!
 * @brief SCG system clock type.
 */
typedef enum _scg_sys_clk
{
    kSCG_SysClkSlow, /*!< System slow clock. */
    kSCG_SysClkBus,  /*!< Bus clock.         */
    kSCG_SysClkCore, /*!< Core clock.        */
} scg_sys_clk_t;

/*!
 * @brief SCG system clock source.
 */
typedef enum _scg_sys_clk_src
{
    kSCG_SysClkSrcSysOsc = 1U, /*!< System OSC. */
    kSCG_SysClkSrcSirc   = 2U, /*!< Slow IRC.   */
    kSCG_SysClkSrcFirc   = 3U, /*!< Fast IRC.   */
    kSCG_SysClkSrcSysPll = 6U  /*!< System PLL. */
} scg_sys_clk_src_t;

/*!
 * @brief SCG system clock divider value.
 */
typedef enum _scg_sys_clk_div
{
    kSCG_SysClkDivBy1  = 0U,  /*!< Divided by 1.  */
    kSCG_SysClkDivBy2  = 1U,  /*!< Divided by 2.  */
    kSCG_SysClkDivBy3  = 2U,  /*!< Divided by 3.  */
    kSCG_SysClkDivBy4  = 3U,  /*!< Divided by 4.  */
    kSCG_SysClkDivBy5  = 4U,  /*!< Divided by 5.  */
    kSCG_SysClkDivBy6  = 5U,  /*!< Divided by 6.  */
    kSCG_SysClkDivBy7  = 6U,  /*!< Divided by 7.  */
    kSCG_SysClkDivBy8  = 7U,  /*!< Divided by 8.  */
    kSCG_SysClkDivBy9  = 8U,  /*!< Divided by 9.  */
    kSCG_SysClkDivBy10 = 9U,  /*!< Divided by 10. */
    kSCG_SysClkDivBy11 = 10U, /*!< Divided by 11. */
    kSCG_SysClkDivBy12 = 11U, /*!< Divided by 12. */
    kSCG_SysClkDivBy13 = 12U, /*!< Divided by 13. */
    kSCG_SysClkDivBy14 = 13U, /*!< Divided by 14. */
    kSCG_SysClkDivBy15 = 14U, /*!< Divided by 15. */
    kSCG_SysClkDivBy16 = 15U  /*!< Divided by 16. */
} scg_sys_clk_div_t;

/*!
 * @brief SCG system clock configuration.
 */
typedef struct _scg_sys_clk_config
{
    uint32_t divSlow : 4; /*!< Slow clock divider, see @ref scg_sys_clk_div_t. */
    uint32_t divBus : 4;  /*!< Bus clock divider, see @ref scg_sys_clk_div_t.  */
    uint32_t : 4;         /*!< Reserved. */
    uint32_t : 4;         /*!< Reserved. */
    uint32_t divCore : 4; /*!< Core clock divider, see @ref scg_sys_clk_div_t. */
    uint32_t : 4;         /*!< Reserved. */
    uint32_t src : 4;     /*!< System clock source, see @ref scg_sys_clk_src_t. */
    uint32_t : 4;         /*!< reserved. */
} scg_sys_clk_config_t;

/*!
 * @brief SCG clock out configuration (CLKOUTSEL).
 */
typedef enum _clock_clkout_src
{
    kClockClkoutSelScgSlow = 0U, /*!< SCG slow clock. */
    kClockClkoutSelSysOsc  = 1U, /*!< System OSC.     */
    kClockClkoutSelSirc    = 2U, /*!< Slow IRC.       */
    kClockClkoutSelFirc    = 3U, /*!< Fast IRC.       */
    kClockClkoutSelSysPll  = 6U, /*!< System PLL.     */
} clock_clkout_src_t;

/*!
 * @brief SCG asynchronous clock type.
 */
typedef enum _scg_async_clk
{
    kSCG_AsyncDiv1Clk, /*!< The async clock by DIV1, e.g. SOSCDIV1_CLK, SIRCDIV1_CLK. */
    kSCG_AsyncDiv2Clk, /*!< The async clock by DIV2, e.g. SOSCDIV2_CLK, SIRCDIV2_CLK. */
} scg_async_clk_t;

/*!
 * @brief SCG asynchronous clock divider value.
 */
typedef enum scg_async_clk_div
{
    kSCG_AsyncClkDisable = 0U, /*!< Clock output is disabled.  */
    kSCG_AsyncClkDivBy1  = 1U, /*!< Divided by 1.              */
    kSCG_AsyncClkDivBy2  = 2U, /*!< Divided by 2.              */
    kSCG_AsyncClkDivBy4  = 3U, /*!< Divided by 4.              */
    kSCG_AsyncClkDivBy8  = 4U, /*!< Divided by 8.              */
    kSCG_AsyncClkDivBy16 = 5U, /*!< Divided by 16.             */
    kSCG_AsyncClkDivBy32 = 6U, /*!< Divided by 32.             */
    kSCG_AsyncClkDivBy64 = 7U  /*!< Divided by 64.             */
} scg_async_clk_div_t;

/*!
 * @brief SCG system OSC monitor mode.
 */
typedef enum _scg_sosc_monitor_mode
{
    kSCG_SysOscMonitorDisable = 0U,                      /*!< Monitor disabled.                                */
    kSCG_SysOscMonitorInt     = SCG_SOSCCSR_SOSCCM_MASK, /*!< Interrupt when the system OSC error is detected. */
    kSCG_SysOscMonitorReset =
        SCG_SOSCCSR_SOSCCM_MASK | SCG_SOSCCSR_SOSCCMRE_MASK /*!< Reset when the system OSC error is detected.  */
} scg_sosc_monitor_mode_t;

